# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'


# Binaries
brew 'bash' # Latest Bash version
brew 'the_silver_searcher'
brew 'wget'

brew 'rename'
brew 'xz'
brew 'openssl'
brew 'readline'
brew 'gettext'

# Kubernetes
cask 'docker'


# Apps
cask 'caffeine'
cask 'github'

# Editors
cask 'intellij-idea-ce'
cask 'pycharm-ce'
cask 'goland'
cask 'visual-studio-code'
