# Install using 'brew bundle install'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

brew 'mas'

# Binaries
brew 'autojump'
brew 'bash' # Latest Bash version
brew 'ffmpeg'
brew 'fzf'
brew 'gettext'
brew 'hyperkit'
brew 'jenv'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'pure'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'rename'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'tree'
brew 'watchexec'
brew 'wget'
brew 'wget'
brew 'xz'

# Apps
cask 'beyond-compare'
cask 'caffeine'
cask 'figma'
cask 'github'
cask 'iterm2'
cask 'meld'
cask 'postman'
cask 'spectacle'
cask 'obsidian'

# Libraries and Runtime
brew 'go'

# Install cloud tools
brew 'awscli'
cask 'google-cloud-sdk'

# Kubernetes
cask 'docker'

# Browsers
cask 'microsoft-edge'
cask 'firefox'
cask 'google-chrome'


# Editors
cask 'goland'
cask 'intellij-idea-ce'
cask 'pycharm-ce'
cask 'visual-studio-code'
cask 'webstorm'

# App store
mas 'Xcode', id: 497799835
