# Install using 'brew bundle install'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/mas'

brew 'mas'

# Binaries
brew 'bash' # Latest Bash version
brew 'the_silver_searcher'
brew 'wget'
brew 'neovim'
brew 'autojump'
brew 'tree'

brew 'rename'
brew 'xz'
brew 'openssl'
brew 'readline'
brew 'gettext'
brew 'hyperkit'
brew 'pyenv'
brew 'node'
brew 'ffmpeg'

# Libraries and Runtime
brew 'go'

# Kubernetes
cask 'docker'

# Browsers
cask 'microsoft-edge'
cask 'firefox'
cask 'google-chrome'

# Apps
cask 'caffeine'
cask 'spectacle'
cask 'github'

# Editors
cask 'intellij-idea-ce'
cask 'pycharm-ce'
cask 'goland'
cask 'visual-studio-code'

